In [1]:
import pandas as pd

# creating dataset
-dictionary of items
-list of dictionary
- import csv, xisx or json files
# get basic insights
-data selection
 
 -row wise selection
 - column wise selection
# data cleaning and manipulation

In [2]:
movies={
    'title':['inception','the metrix','Interstellar'],
    'year':[2010, 1999, 2014],
    'rating':[8.8,8.7,8.6],
    'genre':['sci-fi','sci-fi','sci-fi'],
}
df= pd.DataFrame(movies)

df

          title  year  rating   genre
0     inception  2010     8.8  sci-fi
1    the metrix  1999     8.7  sci-fi
2  Interstellar  2014     8.6  sci-fi

In [3]:
movies={
    {'title':}
}

SyntaxError: expression expected after dictionary key and ':' (529666222.py, line 2)

In [ ]:
df=pd.read_csv(r"C:\Users\Muskan\Desktop\kc_house_data.csv")

In [ ]:
df.shape

(21613, 21)

In [ ]:
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [ ]:
df.columns.tolist()

['id',
 'date',
 'price',
 'bedrooms',
 'bathrooms',
 'sqft_living',
 'sqft_lot',
 'floors',
 'waterfront',
 'view',
 'condition',
 'grade',
 'sqft_above',
 'sqft_basement',
 'yr_built',
 'yr_renovated',
 'zipcode',
 'lat',
 'long',
 'sqft_living15',
 'sqft_lot15']

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  int64
 1   date           21613 non-null  object
 2   price          21613 non-null  float64
 3   bedrooms       21613 non-null  int64
 4   bathrooms      21613 non-null  float64
 5   sqft_living    21613 non-null  int64
 6   sqft_lot       21613 non-null  int64
 7   floors         21613 non-null  float64
 8   waterfront     21613 non-null  int64
 9   view           21613 non-null  int64
 10  condition      21613 non-null  int64
 11  grade          21613 non-null  int64
 12  sqft_above     21613 non-null  int64
 13  sqft_basement  21613 non-null  int64
 14  yr_built       21613 non-null  int64
 15  yr_renovated   21613 non-null  int64
 16  zipcode        21613 non-null  int64
 17  lat            21613 non-null  float64
 18  long           21613 non-null  float64
 19  sqft_living15  21613 non-null  int64
 20  sqft_lot15     21613 non-null  int64
dtypes: float64(5), int64(15), object(1)
memory usage: 3.5+ MB

In [ ]:
df.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
count,2.161300e+04,2.161300e+04,21613.000000,21613.000000,21613.000000,2.161300e+04,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000
mean,4.580302e+09,5.400881e+05,3.370842,2.114757,2079.899736,1.510697e+04,1.494309,0.007542,0.234303,3.409430,7.656873,1788.390691,291.509045,1971.005136,84.402258,98077.939805,47.560053,-122.213896,1986.552492,12768.455652
std,2.876566e+09,3.671272e+05,0.930062,0.770163,918.440897,4.142051e+04,0.539989,0.086517,0.766318,0.650743,1.175459,828.090978,442.575043,29.373411,401.679240,53.505026,0.138564,0.140828,685.391304,27304.179631
min,1.000102e+06,7.500000e+04,0.000000,0.000000,290.000000,5.200000e+02,1.000000,0.000000,0.000000,1.000000,1.000000,290.000000,0.000000,1900.000000,0.000000,98001.000000,47.155900,-122.519000,399.000000,651.000000
25%,2.123049e+09,3.219500e+05,3.000000,1.750000,1427.000000,5.040000e+03,1.000000,0.000000,0.000000,3.000000,7.000000,1190.000000,0.000000,1951.000000,0.000000,98033.000000,47.471000,-122.328000,1490.000000,5100.000000
50%,3.904930e+09,4.500000e+05,3.000000,2.250000,1910.000000,7.618000e+03,1.500000,0.000000,0.000000,3.000000,7.000000,1560.000000,0.000000,1975.000000,0.000000,98065.000000,47.571800,-122.230000,1840.000000,7620.000000
75%,7.308900e+09,6.450000e+05,4.000000,2.500000,2550.000000,1.068800e+04,2.000000,0.000000,0.000000,4.000000,8.000000,2210.000000,560.000000,1997.000000,0.000000,98118.000000,47.678000,-122.125000,2360.000000,10083.000000
max,9.900000e+09,7.700000e+06,33.000000,8.000000,13540.000000,1.651359e+06,3.500000,1.000000,4.000000,5.000000,13.000000,9410.000000,4820.000000,2015.000000,2015.000000,98199.000000,47.777600,-121.315000,6210.000000,871200.000000

- row wise selestion:
  - iloc - index based selection
  - loc - label bases selection
- column wise selection
  - single column selection
    - dictionary like selection
    - object like selection
  - multiple columns selection
    - dictionary like selection

In [ ]:
df

          title  year  rating   genre
0     inception  2010     8.8  sci-fi
1    the metrix  1999     8.7  sci-fi
2  Interstellar  2014     8.6  sci-fi

In [ ]:
df.loc[2]

title     Interstellar
year              2014
rating             8.6
genre           sci-fi
Name: 2, dtype: object

In [ ]:
df.iloc[-3]

title     inception
year           2010
rating          8.8
genre        sci-fi
Name: 0, dtype: object

In [ ]:
df.iloc[1:3]

          title  year  rating   genre
1    the metrix  1999     8.7  sci-fi
2  Interstellar  2014     8.6  sci-fi

In [ ]:
df.iloc[[2,1]]# if i want select specific row than i use [[]].

          title  year  rating   genre
2  Interstellar  2014     8.6  sci-fi
1    the metrix  1999     8.7  sci-fi

In [ ]:
df.iloc[[2,1],[2,3]]# if i want spesific  row and column:

   rating   genre
2     8.6  sci-fi
1     8.7  sci-fi

In [ ]:
# level means per rendom data:
df

          title  year  rating   genre
0     inception  2010     8.8  sci-fi
1    the metrix  1999     8.7  sci-fi
2  Interstellar  2014     8.6  sci-fi

In [ ]:
df = df.set_index('bedrooms')

In [ ]:
df.loc[2010]

id                    5651500140
date             20140617T000000
price                   272000.0
bedrooms                       3
bathrooms                    2.0
sqft_living                 1380
sqft_lot                    7476
floors                       1.0
waterfront                     0
view                           0
condition                      3
grade                          7
sqft_above                  1380
sqft_basement                  0
yr_built                    1989
yr_renovated                   0
zipcode                    98001
lat                      47.3336
long                    -122.272
sqft_living15               1600
sqft_lot15                  7227
Name: 2010, dtype: object

In [ ]:
df['price']#selct a single column ny name

bedrooms
3    221900.0
3    538000.0
2    180000.0
4    604000.0
3    510000.0
       ...
3    360000.0
4    400000.0
2    402101.0
3    400000.0
2    325000.0
Name: price, Length: 21613, dtype: float64

In [ ]:
df.price# select a column by name(aternative syntax)

bedrooms
3    221900.0
3    538000.0
2    180000.0
4    604000.0
3    510000.0
       ...
3    360000.0
4    400000.0
2    402101.0
3    400000.0
2    325000.0
Name: price, Length: 21613, dtype: float64

In [ ]:
df[['bedrooms','bathrooms']]

KeyError: "['bedrooms'] not in index"

# Data manipulation
  - to remove columns and rows
  - to rename columns 
  - to delete missing values
  - to handale missing values
  - to change the datatype of a column
  - to count the categorical data

In [ ]:
df.columns

Index(['date', 'price', 'bathrooms', 'sqft_living', 'sqft_lot', 'floors',
       'waterfront', 'view', 'condition', 'grade', 'sqft_above',
       'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode', 'lat', 'long',
       'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [ ]:
cols_to_drop=['sqft_living15', 'sqft_lot15']# if i want delete specific column or row whoes repiting multiple times:
df= df.drop(columns=cols_to_drop)
df.columns

Index(['date', 'price', 'bathrooms', 'sqft_living', 'sqft_lot', 'floors',
       'waterfront', 'view', 'condition', 'grade', 'sqft_above',
       'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode', 'lat', 'long'],
      dtype='object')

In [ ]:
df= df.drop(labels=[7129300520])
df

KeyError: '[7129300520] not found in axis'

In [ ]:
rename={
    'lat' : 'latitude',
    'long': 'longitude',
}
df=df.rename(columns=rename)# rename columns using a dictionary
df.columns

Index(['date', 'price', 'bathrooms', 'sqft_living', 'sqft_lot', 'floors',
       'waterfront', 'view', 'condition', 'grade', 'sqft_above',
       'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode', 'latitude',
       'longitude'],
      dtype='object')

In [1]:
df['embarked'].value_counts()

NameError: name 'df' is not defined